app/controllers/school_classes_controller.rb

    def create
        @school_class = SchoolClass.new(school_class_params(:title, :room_number))
        @school_class.save
---
INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Math 101"], ["room_number", 1031], ["created_at", "2020-01-13 19:04:43.949953"], ["updated_at", "2020-01-13 19:04:43.949953"]]