app/controllers/students_controller.rb

INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Ben"], ["last_name", "Kagan"], ["created_at", "2020-01-13 19:03:39.663037"], ["updated_at", "2020-01-13 19:03:39.663037"]]
---
    def create
        @student = Student.new(student_params(:first_name, :last_name))
        @student.save

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "students" SET "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["last_name", "Smith"], ["updated_at", "2020-01-13 19:03:28.695414"], ["id", 1]]
---
    def update
        @student = Student.find(params[:id])
        @student.update(student_params(:first_name, :last_name))